# Общая информатика

## Лабораторная работа № 2

### Содержание

1. Задание
2. Текст программы
3. Описание работы программы

### 1. Задание

Написать программу, умножающую 2 матрицы заданного размера и выводящую результат.

### 2. Блок-схема (не обзятельно) и/или описание алгоритма

С помощью команд cout и int вызываем массив данных и с помощью for вводим значения ячейки матрицы. После этого с помощью команды for перемножаем матрицы и в итоге выводим матрицу в командрную строку

### 3. Текст программы

```c++
#include <iostream>
using namespace std;
int main()
{
	const int N=2;
	const int M=2;
	const int K=5;
	int A[N][M];
	int B[M][K];
	int C[N][K];
	for(int i=0; i<N; i++)
	{
		for(int j=0; j<M; j++)
		{
			cout <<"A["<<i+1<<"], ["<<j+1<<"]=";
			cin >> A[i][j];
		}
	}
	for(int x=0; x<M; x++)
	{
		for(int y=0; y<K; y++)
		{
			cout <<"B["<<x+1<<"], ["<<y+1<<"]=";
			cin >> B[x][y];
		}
	}
	for(int i=0; i<N; i++)
	{
		for(int j=0; j < K; j++)
		{ C[i][j]=0;
		for(int k=0; k < M; k++)
		{ C[i][j]+=A[i][k]*B[k][i];
		}
		}
	}
	for(int i = 0; i < N; i++)
	{
		for(int j = 0; j < K; j++)
		{
			cout << C[i][j] << " ";
		}
		cout << endl;
	}
	system ("pause");
	return 0;
}
```

### 4. Описание работы программы

Размерность матриц может задаваться как пользователем, так и внутри программы, наполнение матриц генерируется случайно. Для выполнения используется только библиотека iostream. Программа написана и протестирована при помощи компилятора Microsoft Visual Studio. 
