# Общая информатика

## Лабораторная работа № 1

### Содержание

1. Условие задачи
2. Текст программы
3. Описание работы прграммы

### 1. Задание

Написать программу, выводящую в табличку значение X и соответствующее значение F(x) с задаваемыми начальным, конечным значениями аргумента и шагом.

### 2. Текст программы
```c++
#include <iostream>
using namespace std;
int main()

{
	double x_n, x_k, x,shag,y;
	int n;
	cout << "enter x_n=";
	cin >> x_n;
	cout << "enter x_k=";
	cin >> x_k;
	cout << "enter n=";
	cin >> n;
	shag = (x_k - x_n) / (n - 1);
	for (int i = 0; i < n; ++i)
	{
		x = x_n + shag * i;
		y = x*x;
		cout << "x[" << i << "]=" << x << "   ";
		cout << "y[" << i << "] = " << y << endl;

	}
	system("pause");
	return(0);
}
```
### 3. Описание работы программы
Зависимость F(x) задается внутри программы, общение с пользователем реализовано посредством консоли. Библиотека iomanip использована для упрощения форматирования вывода. Программа написана и протестирована при помощи компилятора Microsoft Visual Studio.
